Revit 2026 API

# TessellatedShapeBuilderResult Class

---

Describes what TessellatedShapeBuilder has construct.

SystemObject Autodesk.Revit.DBTessellatedShapeBuilderResult

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TessellatedShapeBuilderResult : IDisposable
```
```vb
Public Class TessellatedShapeBuilderResult
	Implements IDisposable
```
```cpp
public ref class TessellatedShapeBuilderResult : IDisposable
```
```fsharp
type TessellatedShapeBuilderResult =
    class
        interface IDisposable
    end
```

The TessellatedShapeBuilderResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreObjectsAvailable | Shows whether 'issues' still contains the original data or whether these data have already been relinquished by 'getGeometricalObjects'. The former is true, the later is false. |
|  | HasInvalidData | Whether there were any inconsistencies in the face sets, stored in the tessellated shape builder while building geometrical objects. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Outcome | What kinds of geometrical objects were built. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TessellatedShapeBuilderResult |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetGeometricalObjects | When called the first time, returns geometrical objects which were built. Later calls will throw exceptions. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIssuesForFaceSet | Returns the array of issues encountered while processing a face set with index 'setIndex'. |
|  | GetNumberOfFaceSets | Gets number of face sets for which 'this' result was obtained. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace